# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 ablation config with GCR-SODAttention.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, GCRSODAttention, []] # 8 GCR-SODAttention on P5 before AIFI
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]] # 11, Y5
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [256, 0.5]] # 15
  - [-1, 1, Conv, [256, 1, 1]] # 16, Y4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 18 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20, X3
  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 16], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256, 0.5]] # 23, F4
  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 11], 1, Concat, [1]] # 25
  - [-1, 3, RepC3, [256, 0.5]] # 26, F5
  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
