# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 with MSA-inspired modules and a four-scale P2/P3/P4/P5 decoder.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, MSPConv, [32]] # 1
  - [-1, 1, MSPConv, [64]] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [4, 1, P2DetailPrior, [64]] # 8 P2 small-object prior
  - [[8, 5], 1, DetailGuidance, []] # 9 guided P3
  - [[8, 6], 1, DetailGuidance, []] # 10 guided P4
  - [[8, 7], 1, DetailGuidance, []] # 11 guided P5

  - [11, 1, SODGuidedAttention, []] # 12 attention-enhanced P5
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 14
  - [-1, 1, Conv, [256, 1, 1]] # 15, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 3, RepC3, [256, 0.5]] # 19
  - [-1, 1, Conv, [256, 1, 1]] # 20, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 22 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 23
  - [-1, 3, RepC3, [256, 0.5]] # 24, X3/P3

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 25
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 26 P2 projection
  - [[-2, -1], 1, Concat, [1]] # 27
  - [-1, 2, RepC3, [256, 0.5]] # 28, F2/P2

  - [24, 1, Conv, [256, 3, 2]] # 29
  - [[-1, 20], 1, Concat, [1]] # 30
  - [-1, 3, RepC3, [256, 0.5]] # 31, F4

  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 15], 1, Concat, [1]] # 33
  - [-1, 3, RepC3, [256, 0.5]] # 34, F5

  - [[28, 24, 31, 34], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
