# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 with P2 detail prior guiding P3/P4/P5.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [4, 1, P2DetailPrior, [64]] # 8 P2 small-object prior
  - [[8, 5], 1, DetailGuidance, []] # 9 guided P3
  - [[8, 6], 1, DetailGuidance, []] # 10 guided P4
  - [[8, 7], 1, DetailGuidance, []] # 11 guided P5

  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]] # 14, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 3, RepC3, [256, 0.5]] # 18
  - [-1, 1, Conv, [256, 1, 1]] # 19, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 21 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256, 0.5]] # 23, X3

  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 19], 1, Concat, [1]] # 25
  - [-1, 3, RepC3, [256, 0.5]] # 26, F4

  - [-1, 1, Conv, [256, 3, 2]] # 27
  - [[-1, 14], 1, Concat, [1]] # 28
  - [-1, 3, RepC3, [256, 0.5]] # 29, F5

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
