# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 with High-Frequency Prior Guidance (HFPG) for small object detection.

# Parameters
nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  # HFPG: generate high-frequency prior from P2 and guide P3/P4/P5.
  - [4, 1, HighFrequencyPrior, [64]]       # 8 M(P2), [B,1,H/4,W/4]
  - [[8, 5], 1, HighFrequencyPriorGuidance, []]  # 9 guided P3
  - [[8, 6], 1, HighFrequencyPriorGuidance, []]  # 10 guided P4
  - [[8, 7], 1, HighFrequencyPriorGuidance, []]  # 11 guided P5

  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]]  # 14, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 16 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 3, RepC3, [256, 0.5]]  # 18, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 19, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 21 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 22 cat guided P3
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (23), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 24, downsample_convs.0
  - [[-1, 19], 1, Concat, [1]]  # 25 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (26), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 27, downsample_convs.1
  - [[-1, 14], 1, Concat, [1]]  # 28 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (29), pan_blocks.1

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
