# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 with SODGA-calibrated detail prior propagation.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, SODGuidedAttention, []] # 8 detail-enhanced P5 semantic seed
  - [[4, 8], 1, SODGAHighFrequencyPrior, [32, 16, 2.0]] # 9 D2 prior
  - [[9, 5], 1, DetailPriorPropagation, [16]] # 10 D3 prior
  - [[9, 6], 1, DetailPriorPropagation, [16]] # 11 D4 prior
  - [[9, 8], 1, DetailPriorPropagation, [16]] # 12 D5 prior
  - [[8, 12], 1, DetailGuidedEnhance, [1.0]] # 13 P5 detail-guided

  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 15
  - [-1, 1, Conv, [256, 1, 1]] # 16, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 18 input_proj.1
  - [[18, 11], 1, DetailGuidedEnhance, [1.0]] # 19 P4 detail-guided lateral
  - [[17, 19], 1, Concat, [1]] # 20
  - [-1, 3, RepC3, [256, 0.5]] # 21
  - [-1, 1, Conv, [256, 1, 1]] # 22, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 23
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 24 input_proj.0
  - [[24, 10], 1, DetailGuidedEnhance, [1.0]] # 25 P3 detail-guided lateral
  - [[23, 25], 1, Concat, [1]] # 26
  - [-1, 3, RepC3, [256, 0.5]] # 27, X3

  - [-1, 1, Conv, [256, 3, 2]] # 28
  - [[-1, 22], 1, Concat, [1]] # 29
  - [-1, 3, RepC3, [256, 0.5]] # 30, F4
  - [[30, 11], 1, DetailGuidedEnhance, [0.5]] # 31 F4 detail-refined

  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 16], 1, Concat, [1]] # 33
  - [-1, 3, RepC3, [256, 0.5]] # 34, F5
  - [[34, 12], 1, DetailGuidedEnhance, [0.5]] # 35 F5 detail-refined

  - [[27, 31, 35], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
