# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-R18 with SODGA, SODGA-calibrated high-frequency prior and detail-aware top-down fusion.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, SODGuidedAttention, []] # 8 detail-enhanced P5 semantic seed
  - [[4, 8], 1, SODCalibratedHighFrequencyPrior, [32, 16, 2.0]] # 9 D2 detail prior

  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.1
  - [[12, 13, 9], 1, DetailAwareFusion, [256]] # 14, Y4

  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 input_proj.0
  - [[14, 15, 9], 1, DetailAwareFusion, [256]] # 16, X3

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 14], 1, Concat, [1]] # 18
  - [-1, 3, RepC3, [256, 0.5]] # 19, F4

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 12], 1, Concat, [1]] # 21
  - [-1, 3, RepC3, [256, 0.5]] # 22, F5

  - [[16, 19, 22], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
