# Ultralytics YOLO, AGPL-3.0 license
# Single-module RT-DETR-R18 config.
# Paper/module: GLVMamba SCPP feature enhancement.
# Placement: enhance the final P3/P4/P5 decoder-input neck features.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]] # 10, Y5
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256, 0.5]] # 14
  - [-1, 1, Conv, [256, 1, 1]] # 15, Y4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 3, RepC3, [256, 0.5]] # 19, X3
  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 15], 1, Concat, [1]] # 21
  - [-1, 3, RepC3, [256, 0.5]] # 22, F4
  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 10], 1, Concat, [1]] # 24
  - [-1, 3, RepC3, [256, 0.5]] # 25, F5
  - [19, 1, SCPPFeatureEnhance, []] # 26 SCPP enhance decoder P3 input
  - [22, 1, SCPPFeatureEnhance, []] # 27 SCPP enhance decoder P4 input
  - [25, 1, SCPPFeatureEnhance, []] # 28 SCPP enhance decoder P5 input
  - [[26, 27, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
